# Análisis de datos de las visitas a los Museos de Madrid

### Proyecto focalizado en el análisis de datos sobre los visitantes en los museos de la Comunidad de Madrid. 


Paula Garcia Fernandez  -  octubre 2024

---

***

## OBTENCIÓN DE LOS DATOS

In [1]:
import pandas as pd

### CONSUMO CULTURAL

In [2]:
# info general datos informacion comunicacion transporte
datos_museos_1 = pd.read_csv('./datos/otros_datos/https-datos-madrid-es-egob-catalogo-201132-0-museos-3.csv' , sep=";", encoding='latin')

# la calificacion por museo es interesante pero el mas visitado es el museo de historia de madrid y algo no me cuadra...
datos_museos_2 = pd.read_csv("./datos/otros_datos/estudioSatisfaccion2023.csv", sep=";", encoding='utf-8')

# IMPORATENTE ESTE ES MUY BUENO PARA UNA INTRO   pero faltan videojuegos... estos snobs culturetas del mundo del arte son de lo peor...
datos_museos_3 = pd.read_csv("./datos/otros_datos/actividades_culturales.csv", sep=",", encoding='utf-8')

# ESTE ESTA MUY GUAY PARA VER LOCALIZACIONES Y FOCOS DE INTERES CULTURAL
datos_museos_4 = pd.read_csv("./datos/otros_datos/MuseosdeMadrid_-1519955177370181428.csv", sep=",", encoding='utf-8')

### **JOBO** - CONSUMO CULTURAL JUVENIL

In [67]:
# USUARIOS ----->   INTERESANTE LA CIUDAD DE PROCEDENCIA
# ENTRADAS ----->   INTERESANTE EL ORGANISMO, EVENTO ...

# 2024 - 2018 ----->   INCOMPLETOS

# 2024
jobo_usuarios_2024 = pd.read_csv("./datos/JOBO/JOBO_usuarios_2024.csv", sep=";", encoding='utf-8')
jobo_entradas_2024 = pd.read_csv("./datos/JOBO/JOBO_entradas_emitidas_2024.csv", sep=";", encoding='utf-8')

# 2023
jobo_usuarios_2023 = pd.read_csv("./datos/JOBO/JOBO_usuarios_2023.csv", sep=";", encoding='utf-8')
jobo_entradas_2023 = pd.read_csv("./datos/JOBO/JOBO_entradas_emitidas_2023.csv", sep=";", encoding='utf-8')

# 2022
jobo_usuarios_2022 = pd.read_csv("./datos/JOBO/JOBO_usuarios_2022.csv", sep=";", encoding='utf-8')
jobo_entradas_2022 = pd.read_csv("./datos/JOBO/JOBO_entradas_emitidas_2022.csv", sep=";", encoding='utf-8')

# 2021
jobo_usuarios_2021 = pd.read_csv("./datos/JOBO/JOBO_usuarios_2021.csv", sep=";", encoding='utf-8')
jobo_entradas_2021 = pd.read_csv("./datos/JOBO/JOBO_entradas_emitidas_2021.csv", sep=";", encoding='utf-8')

# 2020
jobo_usuarios_2020 = pd.read_csv("./datos/JOBO/JOBO_usuarios_2020.csv", sep=";", encoding='latin')
jobo_entradas_2020 = pd.read_csv("./datos/JOBO/JOBO_entradas_emitidas_2020.csv", sep=";", encoding='latin')

# 2019
jobo_usuarios_2019 = pd.read_csv("./datos/JOBO/JOBO_usuarios_2019.csv", sep=";", encoding='latin')
jobo_entradas_2019 = pd.read_csv("./datos/JOBO/JOBO_entradas_emitidas_2019.csv", sep=";", encoding='latin')

# 2018
jobo_entradas_2018 = pd.read_csv("./datos/JOBO/JOBO_entradas_2018.csv", sep=";", encoding='latin')

### TARIFAS Y VISITANTES

In [4]:
# SACAR PRECIOS
tarifas = pd.read_csv("./datos/VISITANTES_GENERAL/tarifas_museos_madrid.csv", sep=",", encoding='utf-8')

# SACAR MEDIA DE EDADES Y PROPORCION DE VISITANTES NACIONALES INTERNACIONALES
visitantes = pd.read_csv("./datos/VISITANTES_GENERAL/visitantes_museos_madrid_visitas.csv", sep=",", encoding='utf-8')

# ESTO MEJOR SACARLO DE MANERA INDIVIDUAL EN CADA MUSEO
visitantes_renta_estudios = pd.read_csv("./datos/VISITANTES_GENERAL/visitantes_museos_madrid_amplio.csv", sep=",", encoding='utf-8')

### MUSEOS INDIVIDUALES

In [5]:
prado = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_del_prado_visitantes_filtrados.csv", sep=",", encoding='utf-8')
caixa_forum = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/caixaforum_madrid_visitantes_filtrados.csv", sep=",", encoding='utf-8')
arqueologico = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_arqueológico_nacional_visitantes_filtrados.csv", sep=",", encoding='utf-8')
cerralbo = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_cerralbo_visitantes_filtrados.csv", sep=",", encoding='utf-8')
romanticismo = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_del_romanticismo_visitantes_filtrados.csv", sep=",", encoding='utf-8')
historia_madrid = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_de_historia_de_madrid_visitantes_filtrados.csv", sep=",", encoding='utf-8')
nacional_de_ciencias_naturales = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_nacional_de_ciencias_naturales_visitantes_filtrados.csv", sep=",", encoding='utf-8')
reina_sofia = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_reina_sofia_visitantes_filtrados.csv", sep=",", encoding='utf-8')
santiago_bernabeu = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_santiago_bernabeu_visitantes_filtrados.csv", sep=",", encoding='utf-8')
sorolla = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_sorolla_visitantes_filtrados.csv", sep=",", encoding='utf-8')
thyssen = pd.read_csv("./datos/MUSEOS_INDIVIDUALES/museo_thyssen_bornemisza_visitantes_filtrados.csv", sep=",", encoding='utf-8')

---

***

# DATA CLEANING

Vamos a comenzar por analizar el interes cultural en general de los españoles

In [6]:
datos_museos_3.head(1)

,Unnamed: 0,Hombres_2021,Hombres_2018,Hombres_2014,Hombres_2010,Mujeres_2021,Mujeres_2018,Mujeres_2014,Mujeres_2010
0,"Visitaron museos, exposiciones y galerías de arte",26.5,46.5,38.8,38.1,24.6,46.9,40.1,37.6

In [7]:
datos_museos_3.describe()

,Hombres_2021,Hombres_2018,Hombres_2014,Hombres_2010,Mujeres_2021,Mujeres_2018,Mujeres_2014,Mujeres_2010
count,27.000000,27.000000,27.000000,23.000000,27.000000,27.000000,27.000000,23.000000
mean,18.029630,28.114815,24.596296,24.530435,18.474074,29.577778,26.470370,24.573913
std,16.154942,18.937767,17.218985,16.104952,18.065364,20.138660,19.071098,16.591625
min,0.400000,1.400000,1.300000,1.500000,0.300000,1.600000,2.200000,1.600000
25%,6.850000,10.200000,7.750000,11.850000,6.750000,10.150000,8.900000,10.700000
50%,13.700000,24.800000,23.400000,23.700000,12.800000,28.700000,25.200000,24.500000
75%,27.250000,43.250000,35.550000,35.500000,25.000000,43.900000,37.150000,34.050000
max,58.100000,62.000000,57.600000,56.000000,65.100000,69.400000,66.500000,61.200000

In [8]:
datos_museos_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    27 non-null     object
 1   Hombres_2021  27 non-null     float64
 2   Hombres_2018  27 non-null     float64
 3   Hombres_2014  27 non-null     float64
 4   Hombres_2010  23 non-null     float64
 5   Mujeres_2021  27 non-null     float64
 6   Mujeres_2018  27 non-null     float64
 7   Mujeres_2014  27 non-null     float64
 8   Mujeres_2010  23 non-null     float64
dtypes: float64(8), object(1)
memory usage: 2.0+ KB

In [9]:
datos_museos_3['Unnamed: 0'].unique()

# para que sea mas claro voy a agrupar las actividades por tipos...

array(['Visitaron museos, exposiciones y galerías de arte', 'Museos',
       'Exposiciones', 'Galerías de arte',
       'Visitaron monumentos y yacimientos', 'Monumentos',
       'Yacimientos arqueológicos', 'Visitaron archivos',
       'Fueron a una biblioteca', 'Ir a una biblioteca',
       'Acceder por internet a la biblioteca', 'Leyeron libros',
       'Libros relacionados con la profesión o estudios',
       'Libros no relacionados con la profesión o estudios',
       'Lectores formato papel', 'Lectores formato digital',
       'Lectores de internet',
       'Asistieron a actividades de artes escénicas', 'Teatro', 'Ópera',
       'Zarzuela', 'Ballet/Danza', 'Circo',
       'Asistieron a actividades de artes musicales',
       'Conciertos de música clásica', 'Conciertos de música actual',
       'Asistieron al cine'], dtype=object)

<span style="color: yellow">**Museos y exposiciones:** Incluye todas las actividades relacionadas con museos, exposiciones y galerías de arte.</span>

<span style="color: yellow">**Monumentos y yacimientos:** Actividades relacionadas con la visita a monumentos históricos y yacimientos arqueológicos.</span>

<span style="color: yellow">**Archivos y bibliotecas:** Incluye visitas a archivos y bibliotecas, tanto físicas como en línea.</span>

<span style="color: yellow">**ectura:** Actividades relacionadas con la lectura de libros, ya sea en formato digital o físico.</span>

<span style="color: yellow">**Artes escénicas:** Incluye actividades como teatro, ópera, zarzuela, ballet, danza, circo.</span>

<span style="color: yellow">**Música:** Actividades relacionadas con conciertos de música clásica o contemporánea.</span>

<span style="color: yellow">**Cine:** Asistencia al cine.</span>

In [10]:
def categorize_activity(activity):
    if 'museos' in activity.lower() or 'exposiciones' in activity.lower() or 'galerías de arte' in activity.lower():
        return 'Museos y exposiciones'
    elif 'monumentos' in activity.lower() or 'yacimientos' in activity.lower():
        return 'Monumentos y yacimientos'
    elif 'biblioteca' in activity.lower() or 'archivos' in activity.lower():
        return 'Archivos y bibliotecas'
    elif 'libros' in activity.lower() or 'lectores' in activity.lower():
        return 'Lectura'
    elif 'teatro' in activity.lower() or 'ópera' in activity.lower() or 'zarzuela' in activity.lower() or \
         'ballet' in activity.lower() or 'danza' in activity.lower() or 'circo' in activity.lower():
        return 'Artes escénicas'
    elif 'conciertos' in activity.lower():
        return 'Música'
    elif 'cine' in activity.lower():
        return 'Cine'
    else:
        return 'Otras actividades'


datos_museos_3['Grupo_Actividad'] = datos_museos_3['Unnamed: 0'].apply(categorize_activity)
datos_museos_3.head(1)

,Unnamed: 0,Hombres_2021,Hombres_2018,Hombres_2014,Hombres_2010,Mujeres_2021,Mujeres_2018,Mujeres_2014,Mujeres_2010,Grupo_Actividad
0,"Visitaron museos, exposiciones y galerías de arte",26.5,46.5,38.8,38.1,24.6,46.9,40.1,37.6,Museos y exposiciones

In [11]:
numeric_columns = ['Hombres_2021', 'Hombres_2018', 'Hombres_2014', 'Hombres_2010', 'Mujeres_2021', 'Mujeres_2018', 'Mujeres_2014', 'Mujeres_2010']

datos_museos_3[numeric_columns] = datos_museos_3[numeric_columns].astype(float)

grouped_data = datos_museos_3.groupby('Grupo_Actividad')[numeric_columns].mean()
grouped_data

,Hombres_2021,Hombres_2018,Hombres_2014,Hombres_2010,Mujeres_2021,Mujeres_2018,Mujeres_2014,Mujeres_2010
Grupo_Actividad,,,,,,,,
Archivos y bibliotecas,10.125000,15.650000,14.350000,14.450000,11.675000,17.700000,16.525000,15.500000
Artes escénicas,2.460000,7.800000,7.400000,6.500000,2.740000,9.940000,9.480000,8.125000
Cine,28.100000,58.400000,54.400000,50.500000,27.400000,57.300000,53.600000,47.700000
Lectura,37.783333,39.866667,36.016667,44.500000,41.283333,43.633333,40.416667,47.633333
Monumentos y yacimientos,23.900000,41.600000,34.000000,33.166667,20.366667,39.733333,33.200000,29.633333
Museos y exposiciones,17.550000,32.800000,26.650000,26.875000,16.025000,33.675000,27.950000,27.000000
Música,7.300000,20.450000,16.900000,18.300000,7.000000,19.100000,16.200000,15.350000
Otras actividades,11.350000,31.500000,28.400000,26.400000,12.050000,33.450000,30.650000,26.250000

In [12]:
datos_museos_2021 = grouped_data[['Hombres_2021', 'Mujeres_2021']]
datos_museos_2021.head(1)

                        Hombres_2021  Mujeres_2021
Grupo_Actividad
Archivos y bibliotecas        10.125        11.675

In [13]:
datos_museos_2018 = grouped_data[['Hombres_2018', 'Mujeres_2018']]
datos_museos_2018.head(1)

                        Hombres_2018  Mujeres_2018
Grupo_Actividad
Archivos y bibliotecas         15.65          17.7

In [14]:
datos_museos_2014 = grouped_data[['Hombres_2014', 'Mujeres_2014']]
datos_museos_2014.head(1)

                        Hombres_2014  Mujeres_2014
Grupo_Actividad
Archivos y bibliotecas         14.35        16.525

In [15]:
datos_museos_2010 = grouped_data[['Hombres_2010', 'Mujeres_2010']]
datos_museos_2010.head(1)

                        Hombres_2010  Mujeres_2010
Grupo_Actividad
Archivos y bibliotecas         14.45          15.5

<span style="color: yellow">Ya tengo mi introduccion, ahora nos vamos a centrar en los jovenes y como de eficaz esta siendo el JOBO</span>

In [16]:
jobo_usuarios_2023.head(1)

,Fecha extracción,Fecha de nacimiento,Ciudad,País,Código postal,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,23/01/2024 14:20,21/11/1997,A CORUÑA,España,15009.0,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
jobo_usuarios_2023_clean = jobo_usuarios_2023[['Ciudad', 'País']]
jobo_usuarios_2023_clean.head(1)

     Ciudad    País
0  A CORUÑA  España

In [18]:
# este calculo lo he tenido que hacer con IA porque aparecian miles de localidades sin identificar bien con su ciudad ... 
# tambien algunas pocas ciudades extranjeras

data = {
    "Comunidad Autónoma": [
        "Andalucía", "Aragón", "Asturias", "Canarias", "Cantabria", "Castilla y León", 
        "Castilla-La Mancha", "Cataluña", "Comunidad Valenciana", "Comunidad de Madrid", 
        "Extremadura", "Galicia", "Islas Baleares", "La Rioja", "Navarra", "País Vasco", 
        "Región de Murcia"],
    "Total": [119, 34, 15, 30, 14, 115, 308, 31, 70, 17561, 47, 46, 13, 6, 17, 49, 30]}

jobo_usuarios_2023_por_comunidad = pd.DataFrame(data)
jobo_usuarios_2023_por_comunidad

      Comunidad Autónoma  Total
0              Andalucía    119
1                 Aragón     34
2               Asturias     15
3               Canarias     30
4              Cantabria     14
5        Castilla y León    115
6     Castilla-La Mancha    308
7               Cataluña     31
8   Comunidad Valenciana     70
9    Comunidad de Madrid  17561
10           Extremadura     47
11               Galicia     46
12        Islas Baleares     13
13              La Rioja      6
14               Navarra     17
15            País Vasco     49
16      Región de Murcia     30

<span style="color: yellow">COMUNIDADES EN DONDE MAS ENTRADAS SE HAN COMPRADO CON EL JOBO</span>

<span style="color: yellow">TENER EN CUENTA QUE EL JOBO SOLO SE USA EN MADRID</span>

In [19]:
jobo_entradas_2023.head(1)

    Año    Mes    Organismo                  Evento  Entradas
0  2023  enero  Circo Price  CIRCO PRICE EN NAVIDAD        59

In [20]:
jobo_usuarios_2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46062 entries, 0 to 46061
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Fecha extracción     46062 non-null  object
 1   Fecha de nacimiento  46053 non-null  object
 2   Ciudad               18911 non-null  object
 3   País                 18978 non-null  object
 4   Código postal        19335 non-null  float64
 5   Unnamed: 5           0 non-null      float64
 6   Unnamed: 6           0 non-null      float64
 7   Unnamed: 7           0 non-null      float64
 8   Unnamed: 8           0 non-null      float64
 9   Unnamed: 9           0 non-null      float64
 10  Unnamed: 10          1 non-null      object
dtypes: float64(6), object(5)
memory usage: 3.9+ MB

In [70]:
def identificar_grupo_actividad(organismo):
    grupos = {
        'Museos y exposiciones': ['Condeduque', 'Conde Duque', 'Matadero', 'Naves del Español en Matadero', 'Naves Matadero'],
        'Monumentos y yacimientos': ['Convenios'],
        'Archivos y bibliotecas': [],
        'Lectura': [],
        'Artes escénicas': ['Circo Price', 'Teatro Español', 'Teatro Circo Price', 'Teatro Fernán Gómez. Centro Cultural de la Villa', 'Fernán Gómez', 'Naves del Español', 'Veranos de la Villa'],
        'Música': [],
        'Cine': ['Cineteca']
    }
    
    for grupo, organismos in grupos.items():
        if organismo in organismos:
            return grupo
    return 'Desconocido'

In [71]:
jobo_entradas_2023 = jobo_entradas_2023[['Organismo', 'Entradas']]

jobo_entradas_2023['Organismo'].unique()

array(['Circo Price', 'Naves del Español en Matadero', 'Teatro Español',
       'Cineteca', 'Condeduque',
       'Teatro Fernán Gómez. Centro Cultural de la Villa',
       'Teatro Circo Price', 'Conde Duque', 'Actividades culturales',
       'Convenios'], dtype=object)

In [92]:
jobo_entradas_2023['Grupo_Actividad'] = jobo_entradas_2023['Organismo'].apply(identificar_grupo_actividad)

jobo_entradas_2023 = jobo_entradas_2023.groupby(['Organismo', 'Grupo_Actividad'])['Entradas'].sum().reset_index()
jobo_entradas_2023

# 2023 limpio

,Organismo,Grupo_Actividad,Entradas
0,Actividades culturales,Desconocido,2045
1,Cineteca,Cine,5046
2,Circo Price,Artes escénicas,979
3,Conde Duque,Museos y exposiciones,707
4,Condeduque,Museos y exposiciones,1203
5,Convenios,Monumentos y yacimientos,478
6,Naves del Español en Matadero,Museos y exposiciones,5845
7,Teatro Circo Price,Artes escénicas,754
8,Teatro Español,Artes escénicas,6837
9,Teatro Fernán Gómez. Centro Cultural de la Villa,Artes escénicas,5656

In [73]:
jobo_entradas_2022 = jobo_entradas_2022[['Organismo', 'Entradas']]

jobo_entradas_2022['Organismo'].unique()

array(['Cineteca', 'Circo Price', 'Fernán Gómez', 'Naves del Español',
       'Teatro Español', 'Actividades Culturales', 'Condeduque', nan],
      dtype=object)

In [93]:
jobo_entradas_2022['Grupo_Actividad'] = jobo_entradas_2022['Organismo'].apply(identificar_grupo_actividad)

jobo_entradas_2022 = jobo_entradas_2022.groupby(['Organismo', 'Grupo_Actividad'])['Entradas'].sum().reset_index()
jobo_entradas_2022

# 2022 limpio

                Organismo        Grupo_Actividad  Entradas
0  Actividades Culturales            Desconocido    1112.0
1                Cineteca                   Cine    2882.0
2             Circo Price        Artes escénicas    3459.0
3              Condeduque  Museos y exposiciones    1555.0
4            Fernán Gómez        Artes escénicas    4793.0
5       Naves del Español        Artes escénicas    7753.0
6          Teatro Español        Artes escénicas    9951.0

In [75]:
jobo_entradas_2021 = jobo_entradas_2021[['Organismo', 'Entradas']]

jobo_entradas_2021['Organismo'].unique()

array(['Conde Duque', 'Fernán Gómez', 'Naves Español en Matadero',
       'Circo Price', 'Teatro Español', 'Cineteca'], dtype=object)

In [94]:
jobo_entradas_2021['Grupo_Actividad'] = jobo_entradas_2021['Organismo'].apply(identificar_grupo_actividad)

jobo_entradas_2021 = jobo_entradas_2021.groupby(['Organismo', 'Grupo_Actividad'])['Entradas'].sum().reset_index()
jobo_entradas_2021

# 2021 limpio

C:\Users\Paula\AppData\Local\Temp\ipykernel_8988\3580523840.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  jobo_entradas_2021['Grupo_Actividad'] = jobo_entradas_2021['Organismo'].apply(identificar_grupo_actividad)

                   Organismo        Grupo_Actividad  Entradas
0                   Cineteca                   Cine      1001
1                Circo Price        Artes escénicas      3198
2                Conde Duque  Museos y exposiciones      1297
3               Fernán Gómez        Artes escénicas      6261
4  Naves Español en Matadero            Desconocido      7608
5             Teatro Español        Artes escénicas      9220

In [77]:
jobo_entradas_2020 = jobo_entradas_2020[['Organismo', 'Entradas']]

jobo_entradas_2020['Organismo'].unique()

array(['Cineteca', 'Conde Duque', 'Fernán Gómez',
       'Naves Español en Matadero', 'Circo Price', 'Teatro Español'],
      dtype=object)

In [95]:
jobo_entradas_2020['Grupo_Actividad'] = jobo_entradas_2020['Organismo'].apply(identificar_grupo_actividad)

jobo_entradas_2020 = jobo_entradas_2020.groupby(['Organismo', 'Grupo_Actividad'])['Entradas'].sum().reset_index()
jobo_entradas_2020

# 2020 limpio

C:\Users\Paula\AppData\Local\Temp\ipykernel_8988\2656106440.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  jobo_entradas_2020['Grupo_Actividad'] = jobo_entradas_2020['Organismo'].apply(identificar_grupo_actividad)

                   Organismo        Grupo_Actividad  Entradas
0                   Cineteca                   Cine    2653.0
1                Circo Price        Artes escénicas    4548.0
2                Conde Duque  Museos y exposiciones    2502.0
3               Fernán Gómez        Artes escénicas    6779.0
4  Naves Español en Matadero            Desconocido    3335.0
5             Teatro Español        Artes escénicas    7903.0

In [79]:
jobo_entradas_2019 = jobo_entradas_2019[['Organismo', 'Entradas']]

jobo_entradas_2019['Organismo'].unique()

array(['Cineteca', 'Conde Duque', 'Fernán Gómez', 'Naves Matadero',
       'Circo Price', 'Teatro Español', 'Madrid Destino'], dtype=object)

In [96]:
jobo_entradas_2019['Grupo_Actividad'] = jobo_entradas_2019['Organismo'].apply(identificar_grupo_actividad)

jobo_entradas_2019 = jobo_entradas_2019.groupby(['Organismo', 'Grupo_Actividad'])['Entradas'].sum().reset_index()
jobo_entradas_2019

# 2019 limpio

        Organismo        Grupo_Actividad  Entradas
0        Cineteca                   Cine   12629.0
1     Circo Price        Artes escénicas    8835.0
2     Conde Duque  Museos y exposiciones    6151.0
3    Fernán Gómez        Artes escénicas   19654.0
4  Madrid Destino            Desconocido     272.0
5  Naves Matadero  Museos y exposiciones    2420.0
6  Teatro Español        Artes escénicas   16924.0

In [80]:
jobo_entradas_2018 = jobo_entradas_2018[['Organismo', 'Entradas']]

jobo_entradas_2018['Organismo'].unique()

array(['Cineteca', 'Conde Duque', 'Fernán Gómez', 'Naves Matadero',
       'Teatro Circo Price', 'Teatro Español', 'Veranos de la Villa',
       'Matadero', 'Circo Price', 'Madrid Destino'], dtype=object)

In [97]:
jobo_entradas_2018['Grupo_Actividad'] = jobo_entradas_2018['Organismo'].apply(identificar_grupo_actividad)

jobo_entradas_2018 = jobo_entradas_2018.groupby(['Organismo', 'Grupo_Actividad'])['Entradas'].sum().reset_index()
jobo_entradas_2018

# 2018 limpio

             Organismo        Grupo_Actividad  Entradas
0             Cineteca                   Cine    5397.0
1          Circo Price        Artes escénicas    2761.0
2          Conde Duque  Museos y exposiciones    2870.0
3         Fernán Gómez        Artes escénicas   17261.0
4       Madrid Destino            Desconocido      64.0
5             Matadero  Museos y exposiciones     150.0
6       Naves Matadero  Museos y exposiciones    2549.0
7   Teatro Circo Price        Artes escénicas    6540.0
8       Teatro Español        Artes escénicas   14805.0
9  Veranos de la Villa        Artes escénicas      70.0

<span style="color: yellow">ACABE CON EL ANALISIS DEL JOBO, VEO QUE LOS MUSEOS TIENEN POPULARIDAD, AUNQUE NO SEAN LOS MAS POPULARES. TAMBIEN PUEDO CONSIDERAR QUE EL JOBO SE USA EN MADRID MAS QUE EN NINGUN OTRO SITIO...</span>

___

___

#   AHORA VAMOS CON LOS MUSEOS DE <span style="color: red">**M**</span><span style="color: yellow">A</span><span style="color: red">**D**</span><span style="color: yellow">R</span><span style="color: red">**I**</span><span style="color: yellow">D</span>

Primero los voy a ordenar del mas al menos visitado

In [116]:
# Estos datos los he extraido de internet como tal ya que no he encontrado ningun data set limpio
#  que me hablara de un numero extacto de visitantes anual por museo

data = {
    "Museo": [
        "Museo del Prado", 
        "Museo Reina Sofía", 
        "Museo Santiago Bernabéu", 
        "Museo Thyssen-Bornemisza", 
        "CaixaForum Madrid", 
        "Museo Nacional de Ciencias Naturales", 
        "Museo Arqueológico Nacional", 
        "Museo Sorolla", 
        "Museo Cerralbo", 
        "Museo de Historia de Madrid", 
        "Museo del Romanticismo"],
    "Visitantes": [
        3000000, 
        4000000, 
        1500000, 
        1000000, 
        1000000, 
        500000, 
        400000, 
        250000, 
        150000, 
        100000, 
        90000]}

ranking_visitas_museos = pd.DataFrame(data)
ranking_visitas_museos

                                   Museo  Visitantes
0                        Museo del Prado     3000000
1                      Museo Reina Sofía     4000000
2                Museo Santiago Bernabéu     1500000
3               Museo Thyssen-Bornemisza     1000000
4                      CaixaForum Madrid     1000000
5   Museo Nacional de Ciencias Naturales      500000
6            Museo Arqueológico Nacional      400000
7                          Museo Sorolla      250000
8                         Museo Cerralbo      150000
9            Museo de Historia de Madrid      100000
10                Museo del Romanticismo       90000

In [121]:
# ahora me gustaria ver cual es el grupo que mas visita cada museo y su nivel de estudios

visitantes.head(1)

,Museo,Visitantes_Hombres (%),Visitantes_Mujeres (%),Edad_<18 (%),Edad_18-35 (%),Edad_36-50 (%),Edad_>50 (%),Locales (%),Nacionales (%),Internacionales (%)
0,Museo del Prado,45,55,10,35,30,25,40,35,25

In [119]:
tarifas.head(1)

,Unnamed: 0,Museo,Entrada general,Día gratuito,Precio reducido,Descuento por edad,Notas adicionales
0,0,Museo del Prado,15€,"Lunes a Sábado 18:00-20:00, Domingos 17:00-19:00","7,50€ (estudiantes, mayores de 65)",Gratis menores de 18 y mayores de 65,Entrada gratuita para desempleados

**OUTLAYERS:** restauraciones chocantes, adquisiciones extraordinarias...